app/services/gist_question_service.rb

  def gist_content
    content = [@question.body]
    content += @question.answers.pluck(:body)
---
SELECT "answers"."body" FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 20]]