app/controllers/admin/answers_controller.rb

  def create
    @answer = @question.answers.new(answer_params)

    if @answer.save
---
INSERT INTO "answers" ("body", "correct", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["body", "wefgrht"], ["correct", 0], ["question_id", 17], ["created_at", "2024-04-24 10:06:25.904535"], ["updated_at", "2024-04-24 10:06:25.904535"]]

  def update
    if @answer.update(answer_params)
---
UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "true"], ["updated_at", "2024-04-24 08:07:02.082815"], ["id", 8]]

  def destroy
    @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 11]]

  def find_question
    @question = Question.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]