app/controllers/admin/questions_controller.rb

	def create
		@question = @test.questions.new(question_params)

		if @question.save
---
INSERT INTO "questions" ("body", "test_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["body", "dvs"], ["test_id", 4], ["created_at", "2024-04-24 10:04:13.409942"], ["updated_at", "2024-04-24 10:04:13.409942"]]

	def destroy
		@test = @question.test
		@question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 18]]

    def find_question
	   	@question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]