app/controllers/admin/tests_controller.rb

	def create
		@test = current_user.authored_tests.new(test_params)

	    if @test.save
---
INSERT INTO "tests" ("title", "level", "category_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "sadefwgre"], ["level", 0], ["category_id", 2], ["created_at", "2024-04-24 06:42:31.992792"], ["updated_at", "2024-04-24 06:42:31.992792"], ["user_id", 1]]

	def destroy
		@test.destroy
---
DELETE FROM "tests" WHERE "tests"."id" = ?  [["id", 5]]

	def find_test
		@test = Test.find(params[:id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]