app/views/test_passages/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? AND (id > 4) ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 1], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 4]]
---
		<p>
	<strong>Total questions:</strong> <%= @test_passage.test.questions.count %>