app/controllers/answers_controller.rb

  def create
    @answer = @question.answers.new(answer_params)

    if @answer.save
---
INSERT INTO "answers" ("body", "correct", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["body", ""], ["correct", 0], ["question_id", 4], ["created_at", "2024-04-11 13:57:48.047076"], ["updated_at", "2024-04-11 13:57:48.047076"]]

  def update
    if @answer.update(answer_params)
---
UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "S"], ["updated_at", "2024-04-11 13:59:15.429120"], ["id", 4]]

  def destroy
    @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 5]]

  def find_question
    @question = Question.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]