app/controllers/questions_controller.rb

	def create
		@question = @test.questions.new(question_params)

		if @question.save
---
INSERT INTO "questions" ("body", "test_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["body", "s"], ["test_id", 1], ["created_at", "2024-04-10 15:41:14.826732"], ["updated_at", "2024-04-10 15:41:14.826732"]]

	def destroy
		@test = @question.test
		@question.destroy

		if @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 5]]

	def find_test
    	@test = Test.find(params[:test_id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def find_question
	   	@question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]