app/controllers/test_passages_controller.rb

  def gist
    gist = GistQuestionService.new(@test_passage.current_question)
    gist.call
    if gist.success?
      gist_url = gist.url_hash
      @gist = Gist.create(user_id: @test_passage.user_id, question_id: @test_passage.current_question.id, gist_url: gist_url)
---
INSERT INTO "gists" ("question_id", "user_id", "gist_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["question_id", 20], ["user_id", 1], ["gist_url", "f0b2e227aec494c3eda063da54ec7e25"], ["created_at", "2024-04-28 07:52:59.090722"], ["updated_at", "2024-04-28 07:52:59.090722"]]

	def set_test_passage
		@test_passage = TestPassage.find(params[:id])
---
SELECT "test_passages".* FROM "test_passages" WHERE "test_passages"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]