app/controllers/test_passages_controller.rb

SELECT "test_passages".* FROM "test_passages" WHERE "test_passages"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def set_test_passage
		@test_passage = TestPassage.find(params[:id])