app/controllers/tests_controller.rb

INSERT INTO "tests" ("title", "level", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "mytnrtbr"], ["level", 1], ["category_id", 1], ["created_at", "2024-04-10 13:16:57.323682"], ["updated_at", "2024-04-10 13:16:57.323682"]]
---
	def create
		@test = @test.new(test_params)

		if @test.save

SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def find_test
		@test = Test.find(params[:id])

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
	def find_user
		@user = User.first