app/controllers/users_controller.rb

INSERT INTO "users" ("email", "admin", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "admin@admin.com"], ["admin", nil], ["created_at", "2024-04-20 11:46:49.489154"], ["updated_at", "2024-04-20 11:46:49.489154"], ["password_digest", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)

    if @user.save