app/models/test_passage.rb

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 1], ["LIMIT", 1]]
---
  def before_validation_set_first_question
    self.current_question = test.questions.first if test.present?

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def next_question
    test.questions.order(:id).where('id > ?', current_question.id).first