app/models/test_passage.rb

SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ? AND (id < 20)  [["test_id", 4]]
---
  def current_question_number
    if next_question || current_question
      test.questions.order(:id).where('id < ?', current_question).count + 1

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 4]]
---
   def total_questions
    test.questions.size

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? AND (id > 4) ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 4]]
---
  def score
    (correct_question.to_f * 100 / test.questions.count).round

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 1], ["LIMIT", 1]]
---
  def before_validation_set_first_question
    self.current_question = test.questions.first if test.present?

SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
def next_question
     test.questions.order(:id).where('id > ?', current_question.id).first