app/views/admin/tests/_form.html.erb

    <%= form.label :category_id %>
    <%= form.collection_select :category_id, Category.all, :id, :title, prompt: t('.prompt') %>
---
SELECT "categories".* FROM "categories"