app/views/admin/tests/_test.html.erb

		<td class="align-middle"><%= test_level(test) %></td>
		<td class="align-middle"><%= test.questions.count %></td>
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 4]]